# Задание № 1: ----------------------------------------
music = ["Ария", "Кино", "Hajime", "Imagine Dragons"]


# Задание № 2: ----------------------------------------
locate = [(43.5992, 39.7257), (45.0448, 38.976), (42.0678, 48.2899),
          (47.2313, 39.7233)]


# Задание № 3: ------------------------------------------
User = {
    "Рост": "180",
    "Имя": "Влад",
    "Страна": "Россия"
}


# Задание № 4: --------------------------------------------
n = input("Угадайте рост ")
if n in User["Рост"]:
    print("Правильно")
else:
    print("Не верно")


# Задание № 5: --------------------------------------------
music_dict = {"Ария": "Беспечный ангел",
              "Кино": "Восьмиклассница",
              "Hajime": "Miyagi & A.Panda - Там ревели горы",
              "Imagine Dragons": "Enemy"}
