# Задание № 1 ----------------------------
ser = ["Ходячие мертвецы", "Красавцы", "Клан Сопрано", "Дневники Вампира"]
for i in ser:
    print("Список:", i)


# Задание № 2 ----------------------------
for p in range(25, 51):
    print(p)


# Задание № 3 ----------------------------
shows = ["Ходячие мертвецы", "Красавцы", "Клан Сопрано", "Дневники вампира"]
for index, show in enumerate(shows):
    print("Индекс:", index)
    print(show)


# Задание № 4 ----------------------------
x = [5, 4, 8, 10]
while True:
    y = input("Угадайте число или введите X для выхода")
    if y == "X":
        break
    try:
        y = int(y)
    except ValueError:
        print("Введите число или X для выхода")
    if y in x:
        print("Верно")
    else:
        print("Не верно")


# Задание № 5 ----------------------------
list1 = [8, 19, 148, 4]
list2 = [9, 1, 33, 83]
list3 = []
for k in list1:
    for g in list2:
        list3.append(k * g)
print(list3)